Revit 2026 API

# IDuctFittingAndAccessoryPressureDropUIServer Methods

---

The IDuctFittingAndAccessoryPressureDropUIServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDBServerId | Returns the Id of the corresponding DB server for which this server provides an optional UI. |
|  | GetDescription | Implement this method to return a description of the server. (Inherited from IExternalServer) |
|  | GetName | Implement this method to return the name of the server. (Inherited from IExternalServer) |
|  | GetServerId | Implement this method to return the id of the server. (Inherited from IExternalServer) |
|  | GetServiceId | Implement this method to return the id of the service. (Inherited from IExternalServer) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server. (Inherited from IExternalServer) |
|  | ShowSettings | Shows the settings UI. |

#### Reference

IDuctFittingAndAccessoryPressureDropUIServer Interface

Autodesk.Revit.UI.Mechanical Namespace